Revit 2027 API
ParameterTypeId.RebarElemLength Property
 "Bar Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarElemLength { get; }
Public Shared ReadOnly Property RebarElemLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarElemLength {
	ForgeTypeId^ get ();
}
static member RebarElemLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace